MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX764F128L.atdf
         <register caption="Interrupt Enable Control Register 1" name="IEC1" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIE" />
            <bitfield mask="0x00000002" name="AD1IE" />
            <bitfield mask="0x00000004" name="PMPIE" />
            <bitfield mask="0x00000008" name="CMP1IE" />
            <bitfield mask="0x00000010" name="CMP2IE" />
            <bitfield mask="0x00000020" name="U3EIE" />
            <bitfield mask="0x00000040" name="U3RXIE" />
            <bitfield mask="0x00000080" name="U3TXIE" />
            <bitfield mask="0x00000100" name="U2EIE" />
            <bitfield mask="0x00000200" name="U2RXIE" />
            <bitfield mask="0x00000400" name="U2TXIE" />
            <bitfield mask="0x00000800" name="I2C2BIE" />
            <bitfield mask="0x00001000" name="I2C2SIE" />
            <bitfield mask="0x00002000" name="I2C2MIE" />
            <bitfield mask="0x00004000" name="FSCMIE" />
            <bitfield mask="0x00008000" name="RTCCIE" />
            <bitfield mask="0x00010000" name="DMA0IE" />
            <bitfield mask="0x00020000" name="DMA1IE" />
            <bitfield mask="0x00040000" name="DMA2IE" />
            <bitfield mask="0x00080000" name="DMA3IE" />
            <bitfield mask="0x00100000" name="DMA4IE" />
            <bitfield mask="0x00200000" name="DMA5IE" />
            <bitfield mask="0x00400000" name="DMA6IE" />
            <bitfield mask="0x00800000" name="DMA7IE" />
            <bitfield mask="0x01000000" name="FCEIE" />
            <bitfield mask="0x02000000" name="USBIE" />
            <bitfield mask="0x04000000" name="CAN1IE" />
            <bitfield mask="0x08000000" name="CAN2IE" />
            <bitfield mask="0x10000000" name="ETHIE" />
            <bitfield mask="0x20000000" name="IC1EIE" />
            <bitfield mask="0x40000000" name="IC2EIE" />
            <bitfield mask="0x80000000" name="IC3EIE" />
         </register>
         <register caption="Interrupt Enable Control Register 2" name="IEC2" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000008" name="U4EIE" />
            <bitfield mask="0x00000010" name="U4RXIE" />
            <bitfield mask="0x00000020" name="U4TXIE" />
            <bitfield mask="0x00000040" name="U6EIE" />
            <bitfield mask="0x00000080" name="U6RXIE" />
            <bitfield mask="0x00000100" name="U6TXIE" />
            <bitfield mask="0x00000200" name="U5EIE" />
            <bitfield mask="0x00000400" name="U5RXIE" />
            <bitfield mask="0x00000800" name="U5TXIE" />
         </register>
         <register caption="Interrupt Priority Control Register 0" name="IPC0" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CTIS" />
            <bitfield mask="0x0000001C" name="CTIP" />
            <bitfield mask="0x00000300" name="CS0IS" />
            <bitfield mask="0x00001C00" name="CS0IP" />
            <bitfield mask="0x00030000" name="CS1IS" />
            <bitfield mask="0x001C0000" name="CS1IP" />
            <bitfield mask="0x03000000" name="INT0IS" />
            <bitfield mask="0x1C000000" name="INT0IP" />
         </register>
         <register caption="Interrupt Priority Control Register 1" name="IPC1" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T1IS" />
            <bitfield mask="0x0000001C" name="T1IP" />
            <bitfield mask="0x00000300" name="IC1IS" />
            <bitfield mask="0x00001C00" name="IC1IP" />
            <bitfield mask="0x00030000" name="OC1IS" />
            <bitfield mask="0x001C0000" name="OC1IP" />
            <bitfield mask="0x03000000" name="INT1IS" />
            <bitfield mask="0x1C000000" name="INT1IP" />
         </register>
         <register caption="Interrupt Priority Control Register 2" name="IPC2" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T2IS" />
            <bitfield mask="0x0000001C" name="T2IP" />
            <bitfield mask="0x00000300" name="IC2IS" />
            <bitfield mask="0x00001C00" name="IC2IP" />
            <bitfield mask="0x00030000" name="OC2IS" />
            <bitfield mask="0x001C0000" name="OC2IP" />
            <bitfield mask="0x03000000" name="INT2IS" />
            <bitfield mask="0x1C000000" name="INT2IP" />
         </register>
         <register caption="Interrupt Priority Control Register 3" name="IPC3" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T3IS" />
            <bitfield mask="0x0000001C" name="T3IP" />
            <bitfield mask="0x00000300" name="IC3IS" />
            <bitfield mask="0x00001C00" name="IC3IP" />
            <bitfield mask="0x00030000" name="OC3IS" />
            <bitfield mask="0x001C0000" name="OC3IP" />
            <bitfield mask="0x03000000" name="INT3IS" />
            <bitfield mask="0x1C000000" name="INT3IP" />
         </register>
         <register caption="Interrupt Priority Control Register 4" name="IPC4" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T4IS" />
            <bitfield mask="0x0000001C" name="T4IP" />
            <bitfield mask="0x00000300" name="IC4IS" />
            <bitfield mask="0x00001C00" name="IC4IP" />
            <bitfield mask="0x00030000" name="OC4IS" />
            <bitfield mask="0x001C0000" name="OC4IP" />
            <bitfield mask="0x03000000" name="INT4IS" />
            <bitfield mask="0x1C000000" name="INT4IP" />
         </register>
         <register caption="Interrupt Priority Control Register 5" name="IPC5" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T5IS" />
            <bitfield mask="0x0000001C" name="T5IP" />
            <bitfield mask="0x00000300" name="IC5IS" />
            <bitfield mask="0x00001C00" name="IC5IP" />
            <bitfield mask="0x00030000" name="OC5IS" />
            <bitfield mask="0x001C0000" name="OC5IP" />
            <bitfield mask="0x03000000" name="SPI1IS" />
            <bitfield mask="0x1C000000" name="SPI1IP" />
         </register>
         <register caption="Interrupt Priority Control Register 6" name="IPC6" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U1IS" />
            <bitfield mask="0x0000001C" name="U1IP" />
            <bitfield mask="0x00000300" name="I2C1IS" />
            <bitfield mask="0x00001C00" name="I2C1IP" />
            <bitfield mask="0x00030000" name="CNIS" />
            <bitfield mask="0x001C0000" name="CNIP" />
            <bitfield mask="0x03000000" name="AD1IS" />
            <bitfield mask="0x1C000000" name="AD1IP" />
         </register>
